       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLICATION-BAjD.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 LINE-NO PIC 99.
       77 COL-NO PIC 99.
       01 PRINT-LINE.
           02 NUM OCCURS 10 PIC ZZZ9.

       PROCEDURE DIVISION.
       PSTART.
           PERFORM PLINE VARYING LINE-NO
                   FROM 1 BY 1 UNTIL LINE-NO > 10
           STOP RUN.
       PLINE.
           MOVE SPACES TO PRINT-LINE.
           PERFORM PNUM VARYING COL-NO
                   FROM 1 BY 1 UNTIL COL-NO > LINE-NO
           DISPLAY PRINT-LINE.
       PNUM.
           MULTIPLY LINE-NO BY COL-NO GIVING NUM(COl-NO).
